// 설문조사에 관련된 내용들을 정리합니다.

export const questions = {
  Q1: "콘텐츠를 추천 받고 싶은\n지역을 골라주세요.",
  Q2: "새로운 체험 장소에 가게 된다면\n어떤 상황이 가장 좋을까요?",
  Q3: "주말에 여유 시간이 생겼을 때 가장\n하고 싶은 활동은 어떤 것인가요?",
  Q4: "콘텐츠를 고를 때, 더 흥미로운\n요소는 어떤 것인가요?",
  Q5: "전시나 공연을 관람할 때\n당신의 스타일은 어떤가요?",
  Q6: "어떤 상황에서 체험 콘텐츠가\n더 즐겁다고 느끼나요?",
};

export const options = {
  Q1: [
    "서울",
    "경기, 인천",
    "강원",
    "충청권(충북, 대전, 세종)",
    "충남",
    "대구, 경북",
    "경남, 울산",
    "광주, 전남",
    "전북",
    "부산",
    "제주",
  ],
  Q2: [
    "처음 보는 사람들과도 함께 어울리는 분위기",
    "친한 사람들과 함께 가는 안정적인 분위기",
    "혼자 조영히 체험하는 여유로운 분위기",
    "사람 많은 곳은 피하고 싶고 혼자가 편하다",
  ],
  Q3: [
    "처음 보는 사람들과도 함께 어울리는 분위기",
    "친한 사람들과 함께 가는 안정적인 분위기",
    "혼자 조영히 체험하는 여유로운 분위기",
    "사람 많은 곳은 피하고 싶고 혼자가 편하다",
  ],
  Q4: [
    "색감, 조명, 공간 연출 등 시각적 자극",
    "몰입감을 주는 현장 경험",
    "주제의 메시지나 배경 맥락",
    "자료나 설명이 잘 정리된 구성",
  ],
  Q5: [
    "날짜와 시간표를 미리 정리해서 계획적으로 간다",
    "대략 정해두고 현장에서 유연하게 즐긴다",
    "누가 같이 가자고 하면 즉흥적으로 간다",
    "일정 잡는 게 귀찮아서 잘 안가게 된다",
  ],
  Q6: [
    "새로운 사람들과도 어울릴 수 있는 열린 분위기",
    "친한 친구와 단둘이 함께하는 체험",
    "혼자 조용히 체험하며 몰입하는 시간",
    "상황에 따라 다르지만 대체로 혼자가 더 편하다",
  ],
};
